#include <iostream>
#include <cmath> // для pow()
using namespace std;

int main()
{
    // Begin37
    
    
    // декларація змінних
    double a, b;
   
    // введеня змінних
    cout << "Ця програма обчислює середнє гармонічне." << endl;
    cout << "Введіть перше число: ";
    cin >> a;
    cout << "Введіть друге число: ";
    cin >> b;
   
    // обчислення середнього гармонічного
    double H = 2 * a * b / (a + b);
   

   
    //Begin16
   
   
    // декларація змінної
    double x, y;

    // введення змінної
    cout << "Ця програма обчислює значення функції y = 3x^6 - 6x^2 - 7." << endl;
    cout << "Введіть значення x: ";
    cin >> x;

    // обчислення значення функції
    y = 3 * pow(x, 6) - 6 * pow(x, 2) - 7;

    // виведення результату
    cout << "Значення функції y при x = " << x << " дорівнює: " << y << endl;
    
    
    //Begin25
    
    
    // декларація змінних
    double X, A, Y, B;

    // введення змінних
    cout << "Ця програма обчислює вартість шоколадних цукерок і печива, " << endl;
    cout << "а також визначає у скільки разів шоколадні цукерки дорожчі за печиво." << endl;
    cout << "Введіть вагу шоколадних цукерок (кг): ";
    cin >> X;
    cout << "Введіть ціну шоколадних цукерок (грн): ";
    cin >> A;

    cout << "Введіть вагу печива (кг): ";
    cin >> Y;
    cout << "Введіть ціну печива (грн): ";
    cin >> B;

    // обчислення вартості за 1 кг
    double candyPrice = A / X;
    double cookiePrice = B / Y;

    // обчислення співвідношення
    double difference = candyPrice / cookiePrice;

    // Виведення результатів
    cout << "Ціна 1 кг шоколадних цукерок: " << candyPrice << " грн" << endl;
    cout << "Ціна 1 кг печива: " << cookiePrice << " грн" << endl;
    cout << "Шоколадні цукерки дорожчі за печиво у " << difference << " раз(и)" << endl;

    return 0;
}
